In [1]:
# Constants
KEYWORD="data scientist"
COUNTRY = "United States"
NUM_OF_JOBS= 1000

DF_PATH_PKL = f"../data/raw/2_{NUM_OF_JOBS}_jobs_{KEYWORD}_{COUNTRY}_cleaned_data_df.pkl"
DF_PATH_CSV = f"../data/raw/2_{NUM_OF_JOBS}_jobs_{KEYWORD}_{COUNTRY}_cleaned_data_df.csv"

# EXPORT_PATH_PKL = # f"../data/raw/2_{NUM_OF_JOBS}_jobs_{KEYWORD}_{COUNTRY}_cleaned_data_df.pkl"
# EXPORT_PATH_CSV = #f"../data/raw/2_{NUM_OF_JOBS}_jobs_{KEYWORD}_{COUNTRY}_cleaned_data_df.csv"

FIG_DIR = "../reports/figures"

# REPLACED_DICT = {
#     'Founded' : {'Nonprofit Organization' : -1, 'Government' : -1, 'Company - Private' : -1,
#                  'Government' : -1, 'Company - Public': -1}
# }

In [2]:
# Load packages
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

pd.options.display.max_rows = 10000
pd.options.display.max_columns = 10000

In [3]:
raw_df = pd.read_pickle(DF_PATH_PKL)
df = raw_df.copy()
df.head(2)

,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,Type of ownership,Industry,Sector,Revenue,Competitors,hourly,employer_provided,min_salary,max_salary,avg_salary,company_txt,job_state,some_state,age,python_yn,tableau_yn,tensorflow_yn,excel_yn,aws_yn,sql_yn,r_studio_yn,sas_yn
0,Data Scientist - REMOTE,$87K - $121K (Glassdoor est.),There are over 7 billion people on this planet...,4,John Deere\n4.1,"Washington, DC",John May,10000+ Employees,1837,Company - Public,Machinery Manufacturing,Manufacturing,$10+ billion (USD),-1,0,0,87,121,104.0,John Deere\n,Washington,0,185,1,1,0,0,1,0,1,0
1,Junior Data Scientist,$70K - $108K (Glassdoor est.),Job #:\nreq19774\n\nOrganization:\nWorld Bank\...,-1,World Bank Group\n4.2,"Washington, DC",-1,10000+ Employees,-1,$1 to $5 billion (USD),-1,-1,-1,-1,0,0,70,108,89.0,World Bank Group\n,Washington,0,-1,1,0,0,1,1,0,1,0

In [4]:
df.sample(1).iloc[0]

Job Title            Data Scientist - Entry to Expert Level (Maryla...
Salary Estimate                  Employer Provided Salary:$75K - $176K
Job Description      Duties\nAs a Data Scientist, your responsibili...
Rating                                                               2
Company Name         US National Security Agency/Central Security S...
Location                                                        Remote
Headquarters
Size                                               51 to 200 Employees
Founded                                                             -1
Type of ownership                              $5 to $25 million (USD)
Industry                                                            -1
Sector                                                              -1
Revenue                                                             -1
Competitors                                                         -1
hourly                                                               0
employer_provided                                                    1
min_salary                                                          75
max_salary                                                         176
avg_salary                                                       125.5
company_txt          US National Security Agency/Central Security S...
job_state                                                       Remote
some_state                                                           0
age                                                                 -1
python_yn                                                            0
tableau_yn                                                           0
tensorflow_yn                                                        0
excel_yn                                                             0
aws_yn                                                               0
sql_yn                                                               0
r_studio_yn                                                          1
sas_yn                                                               0
Name: 872, dtype: object

In [5]:
df.columns

Index(['Job Title', 'Salary Estimate', 'Job Description', 'Rating',
       'Company Name', 'Location', 'Headquarters', 'Size', 'Founded',
       'Type of ownership', 'Industry', 'Sector', 'Revenue', 'Competitors',
       'hourly', 'employer_provided', 'min_salary', 'max_salary', 'avg_salary',
       'company_txt', 'job_state', 'some_state', 'age', 'python_yn',
       'tableau_yn', 'tensorflow_yn', 'excel_yn', 'aws_yn', 'sql_yn',
       'r_studio_yn', 'sas_yn'],
      dtype='object')

In [26]:
# Invesigate the questionable objects columns
questionable_cols = ['Job Title','company_txt']

for col in questionable_cols:
    print(col)
    print(df[col].unique().tolist())
    print('--------------------------------------------')
    print()

Job Title
['Data Scientist - REMOTE', 'Junior Data Scientist', 'Data Scientist or Bioinformatician (remote)', 'Data Scientist', 'Jr. Data Scientist', 'Associate Data Scientist, 2023 Graduate', 'Remote Data Scientist', 'Data Scientist - Associate', 'Analyst, Data Scientist', 'Data Scientist I', 'Data Scientist- Personalized Healthcare', 'Data Scientist I (Remote)', 'Data Scientist I, Risk Analytics', 'Data Scientist (Remote)', 'Data Scientist, AI Services - Mastercard Launch 2023', 'Principal Data Scientist, Customer Analytics', 'Data Scientist Remote', 'Data Scientist (REMOTE)', 'Data Scientist (Virtual)', 'Data Scientist / Quantitative Analyst', 'Data scientist - Junior AI research Analyst', 'Principal Data Scientist', 'Data Scientist Analyst', 'Data Scientist, Creator Promotion', 'CCB Data & Analytics - Data Consumption & Product Operations Team - Data Scientist Analyst Expert - New York, Jersey City, and/or Wilmington', 'Data Scientist - Entry to Expert Level (Maryland Location)', 'Research Associate', 'Data Scientist, Customer Analytics', 'Data Scientist - Hybrid', 'VIE New York City- Data Scientist', 'Staff Data Scientist', 'Data Scientist, Product Analytics', 'Data Scientist (Remote or Hybrid)', 'Data Scientist (Level I - II)', 'Data Scientist, Deep Learning', 'Senior Data Scientist, Machine Learning - Game Analytics', 'Data Scientist II - AI and Machine Learning', 'Data Scientist II, Analytics', 'Associate Data Scientist', 'Data Scientist - Insights', 'Bioinformatician', 'Healthcare Data Scientist']
--------------------------------------------

company_txt
['John Deere\n', 'World Bank Group\n', 'UT Southwestern Medical Center\n', 'Microsoft\n', 'NetAspire', 'Atlassian\n', 'Narvee Technologies pvt ltd', 'Saint-Gobain\n', 'JPMorgan Chase Bank, NA\n', 'Caterpillar\n', 'Analog Devices\n', 'The Trade Desk\n', 'Genentech\n', 'Noblis\n', 'Synaptec Health', 'Peek Vision Ltd', 'Activision\n', 'Disney Media & Entertainment Distribution\n', 'Waymo\n', 'Paramount Networks International\n', 'proit-inc', 'Verizon\n', 'Truist Financial\n', 'Lightcast\n', 'Oscar Health\n', 'Smartcar\n', 'Crum & Forster\n', 'Yelp\n', 'Mastercard\n', 'CVS Health\n', 'PayPal\n', 'Jun Group\n', 'Continental Finance Company\n', 'FirstEnergy Corp\n', 'State Farm\n', 'Sunixa Solutions', 'Safety National\n', 'BOEING\n', 'Wolverine Trading\n', 'NYC Careers\n', 'Ranial Systems Inc', 'Roche\n', 'Dworoio', 'National Security Agency\n', 'Fidelity Investments\n', 'Elevance Health\n', 'Spotify\n', 'IFC Systems Corporation\n', 'Augray\n', 'US National Security Agency/Central Security Service\n', 'LexisNexis\n', 'dYdX\n', 'VNS Health\n', 'SupplyHouse\n', 'Dataworks', 'Peapod Digital Labs\n', 'Acelot\n', 'Spring Health\n', 'Citi\n', 'N solutions', 'Source Enterprises\n', "L'Oreal\n", 'Vanguard\n', 'Lucid Motors\n', 'Peloton\n', 'QVC\n', 'BEN Group, Inc\n', 'Fetch Rewards\n', 'Rockstar Games\n', 'Novo Nordisk\n', 'American Express Global Business Travel\n', 'Abbott Laboratories\n', 'CaaStle\n', 'Booz Allen Hamilton\n', 'University of Maryland Medical System\n']
--------------------------------------------

In [7]:
def title_siplifier(title):
    if 'data scientist' in title.lower():
        return 'data scientist'
    elif 'data engineer' in title.lower():
        return 'data engineer'
    elif 'analyst' in title.lower():
        return 'analyst'
    elif 'machine learning' in title.lower():
        return 'mle'
    elif 'manager' in title.lower():
        return 'manager'
    elif 'director' in title.lower():
        return 'director'
    else:
        return 'na'
    
def seniority(title):
    if 'sr' in title.lower() or 'senior' in title.lower() or 'sr' in title.lower() or \
                'lead' in title.lower() or 'principal' in title.lower() or 'expert' in title.lower():
        return 'senior'
    elif 'jr'in title.lower() or 'jr.' in title.lower() or 'junior' in title.lower() or 'entry' in title.lower():
        return 'jr'
    else:
        return 'na'
    
# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
## Job title and seniority
## Job description length
## hourly wage to annual
## remove ne line from job title

In [8]:
df['job_simp'] = df['Job Title'].apply(title_siplifier)
display(df['job_simp'].value_counts())
display(df[df['job_simp']=='na'][['Job Title','job_simp']])

data scientist    831
na                  4
Name: job_simp, dtype: int64

              Job Title job_simp
102  Research Associate       na
132  Research Associate       na
162  Research Associate       na
174    Bioinformatician       na

In [9]:
df['seniority'] = df['Job Title'].apply(seniority)
display(df['seniority'].value_counts())
# display(df[df['seniority']=='senior'][['Job Title','seniority']])

na        644
senior    103
jr         88
Name: seniority, dtype: int64

In [10]:
# Job description Length
df['desc_len'] = df['Job Description'].apply(lambda x: len(x))
df['desc_len'][:20]

0     5645
1     6232
4     2511
5     4076
10    1124
12    3965
15    1365
16    6440
17    5127
20    4161
21    4660
23    1717
24    8086
25    5036
26    4086
28    8094
29    5890
30    4950
32    5206
33    7127
Name: desc_len, dtype: int64

In [23]:
# hourly wage to annual
df['min_salary'] = df.apply(lambda x: x['min_salary']*2 if x['hourly'] == 1 else x['min_salary'],axis=1)
df['max_salary'] = df.apply(lambda x: x['max_salary']*2 if x['hourly'] == 1 else x['max_salary'],axis=1)

In [25]:
### Visually verify results
i = df.sample(1).index[0]
display( raw_df[raw_df['hourly'] == 1][['hourly','min_salary','max_salary']])
display( df[df['hourly'] == 1][['hourly','min_salary','max_salary']])

# display(df[['min_salary','max_salary']])

     hourly  min_salary  max_salary
15        1          50          55
51        1          20          20
57        1          70          80
89        1          70          80
100       1          70          80
127       1          70          80
157       1          70          80

     hourly  min_salary  max_salary
15        1         200         110
51        1          80          40
57        1         280         160
89        1         280         160
100       1         280         160
127       1         280         160
157       1         280         160

In [28]:
# remove ne line from job title
df['company_txt'] = df['company_txt'].apply(lambda x: x.replace('\n',''))
print(df['company_txt'][:3].unique().tolist())

['John Deere', 'World Bank Group', 'UT Southwestern Medical Center']

In [38]:
df.describe()

,Rating,Founded,Competitors,hourly,employer_provided,min_salary,max_salary,avg_salary,some_state,age,python_yn,tableau_yn,tensorflow_yn,excel_yn,aws_yn,sql_yn,r_studio_yn,sas_yn,desc_len
count,835.000000,835.000000,835.0,835.000000,835.000000,835.000000,835.000000,835.000000,835.0,835.000000,835.00000,835.000000,835.000000,835.000000,835.000000,835.000000,835.0,835.000000,835.000000
mean,2.855090,1607.070659,-1.0,0.008383,0.428743,95.609581,142.664671,118.098204,0.0,51.336527,0.79521,0.276647,0.117365,0.329341,0.208383,0.001198,1.0,0.101796,4998.712575
std,1.648146,755.178249,0.0,0.091230,0.495193,26.146670,36.013588,26.357495,0.0,62.945967,0.40379,0.447608,0.322048,0.470256,0.406396,0.034606,0.0,0.302562,2434.260978
min,-1.000000,-1.000000,-1.0,0.000000,0.000000,55.000000,40.000000,20.000000,0.0,-1.000000,0.00000,0.000000,0.000000,0.000000,0.000000,0.000000,1.0,0.000000,1124.000000
25%,3.000000,1837.000000,-1.0,0.000000,0.000000,76.000000,120.000000,97.000000,0.0,8.000000,1.00000,0.000000,0.000000,0.000000,0.000000,0.000000,1.0,0.000000,3875.000000
50%,3.000000,1963.000000,-1.0,0.000000,0.000000,92.000000,133.000000,114.000000,0.0,20.000000,1.00000,0.000000,0.000000,0.000000,0.000000,0.000000,1.0,0.000000,4981.000000
75%,4.000000,2004.000000,-1.0,0.000000,1.000000,105.000000,160.000000,129.500000,0.0,97.000000,1.00000,1.000000,0.000000,1.000000,0.000000,0.000000,1.0,0.000000,5718.500000
max,4.000000,2021.000000,-1.0,1.000000,1.000000,280.000000,350.000000,225.000000,0.0,397.000000,1.00000,1.000000,1.000000,1.000000,1.000000,1.000000,1.0,1.000000,14965.000000